#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <time.h>
#include <stdlib.h>

//¸ğ¸£°Ú´Â °Í : 
//1. continue, break¹®ÀÇ Èå¸§ Çò°¥¸²
//2. flagÀÇ 0, 1 ON, OFF ÀÌÇØ¾ÈµÊ
//3. ÀüÃ¼ÀûÀÎ Èå¸§

int main() {
	int choice, c_answer, score;//choice:À¯Àú ¼±ÅÃ, c_answer: Á¤´ä, score: Á¡¼ö
	int level = 0;//°ÔÀÓ ³­ÀÌµµ
	int totalScore = 0;//ÃÑ Á¡¼ö
	int flag = 0;//?

	//rand() ¾²±âÀü¿¡ ÃÊ±âÈ­
	srand(time(NULL));//¸Å¹ø ´Ù¸¥ ·£´ı¼ıÀÚ°¡ ³ª¿À°Ô ÇØÁÖ´Â ÇÔ¼ö


	//while(1)Àº ¾ğÁ¦³ª ÂüÀÌ¶ó´Â ÀÇ¹ÌÀÌ¸ç, break¹®ÀÌ Æ÷ÇÔµÈ Á¶°ÇÀÌ ¸¸Á·ÇÒ ¶§±îÁö ¹«ÇÑÀ¸·Î ½ÇÇàµÇ°Ô µË´Ï´Ù.
	while (1) {
		//°ÔÀÓ ¾È³»
		printf("===== ³­¼ö ¸ÂÃß±â °ÔÀÓ =====\n");
		printf("1. ³­ÀÌµµ ¼³Á¤   2. °ÔÀÓÇÏ±â   3. ³» Á¡¼ö º¸±â   4. Á¾·áÇÏ±â\n");
		printf("¸Ş´º ¼±ÅÃ >>>>> ");

		//À¯Àú°¡ ÀÔ·ÂÇÑ ¹øÈ£ scan
		scanf("%d", &choice);



		//[4.Á¾·áÇÏ±â] ¼±ÅÃÇßÀ» ¶§,
		if (choice == 4) {
			printf("4¹ø ´­·¯¼­ Á¾·á.\n");
			break;//break¹®ÀÌ Æ÷ÇÔµÈ ÀÌ Á¶°Ç¹®ÀÌ ¸¸Á·ÇßÀ¸¹Ç·Î while¹® ¹«ÇÑ·çÇÁ ºüÁ®³ª¿È.= Á¾·á
		} // Á¾·áÇÏ±â if¹® ´İ´Â Áß°ıÈ£




	//[1.³­ÀÌµµ ¼³Á¤] ¼±ÅÃÇßÀ» ¶§,
		else if (choice == 1) {
			while (flag == 0) {//flag == 0 ...????

				//³­ÀÌµµ ¼³Á¤ ¾È³»
				printf("1. »ó : 1 ~ 20±îÁö Áß ·£´ı ¼ıÀÚ ¸ÂÃß±â\nº¸»ó : 100Á¡\n");
				printf("2. Áß : 1 ~ 10±îÁö Áß ·£´ı ¼ıÀÚ ¸ÂÃß±â\nº¸»ó : 50Á¡\n");
				printf("3. ÇÏ : 1 ~  5±îÁö Áß ·£´ı ¼ıÀÚ ¸ÂÃß±â\nº¸»ó : 25Á¡\n");

				//À¯Àú°¡ ÀÔ·ÂÇÑ ¹øÈ£ scan
				scanf("%d", &choice);
				switch (choice) {
				case 1:
					level = 3;//levelÀº [2.°ÔÀÓÇÏ±â]¿¡¼­ ¼³Á¤ÇÑ level (level.3 = ³­ÀÌµµ »ó)
					printf("³­ÀÌµµ »óÀ¸·Î ¼³Á¤µÇ¾ú½À´Ï´Ù.\n");
					flag = 1;//flag == 1 ??????  flag==1ÀÌ¸é ON /flag==0ÀÌ¸é OFF (ºñÆ®¿¬»êÈ°¿ë) ÀÎ°¡¿ä? ==> ±×·³, ¿©±â case¹®ÀÌ ¸¸Á·ÇÏ¸é break¹® ³ª¿À°í °ÔÀÓÇÏ±â·Î ON? => ¾îµğ·Î°¡´Â°ÇÁö
					break;//choice = 1ÀÌ¸é ÇØ´ç case ¸¸Á·ÇØ¼­ switch¹İº¹¹®À» ³ª°¨
				case 2:
					level = 2;
					printf("³­ÀÌµµ ÁßÀ¸·Î ¼³Á¤µÇ¾ú½À´Ï´Ù.\n");
					flag = 1;
					break;
				case 3:
					level = 1;
					printf("³­ÀÌµµ ÇÏÀ¸·Î ¼³Á¤µÇ¾ú½À´Ï´Ù.\n");
					flag = 1;
					break;
				default:
					printf("Àß¸ø ÀÔ·ÂÇÏ¼Ì½À´Ï´Ù.\n");//1,2,3 ¿ÜÀÇ ¼ıÀÚ ÀÔ·Â½Ã, switch¹® ¹ş¾î³ª¼­, ³­ÀÌµµ ¼³Á¤ ¾È³» ´Ù½Ã ³ª¿È
				} // switch¹® ´İ´Â Áß°ıÈ£

			} // ³­ÀÌµµ ¼³Á¤ while¹® ´İ´Â Áß°ıÈ£

			flag = 0;//?????????
		} // 1¹ø ³­ÀÌµµ ¼³Á¤ else if¹® ´İ´Â Áß°ıÈ£




		//[2.°ÔÀÓÇÏ±â] ¼±ÅÃÇßÀ» ¶§
		else if (choice == 2) {
			// ³­ÀÌµµ¸¦ ¼³Á¤ÇÏÁö ¾Ê°í, [2.°ÔÀÓÇÏ±â]¸¦ ¸ÕÀú ¼±ÅÃÇß´Ù¸é,(±Ùµ¥ ¿Ö levelÀÌ 0ÀÌ¸é, ³­ÀÌµµ¸¦ ¼³Á¤ÇÏÁö ¾ÊÀº°ÍÃ³·³ ³ª¿ÀÁö?)
			if (level == 0) { //levelÀº 1,2,3¸¸ °ÔÀÓÇÏ±â °¡´É
				printf("³­ÀÌµµ¸¦ ¸ÕÀú ¼³Á¤ÇÏ¼¼¿ä\n");
				continue;//continue¹® ½ÇÇà½Ã, ¾îµğ·Î ÀÌµ¿??=> if¹® ³ª¿Í¼­ while¹®ÀÇ ¹«ÇÑ·çÇÁ·Î ÀÌµ¿?
			}
			// level 3 = ³­ÀÌµµ »ó
			else if (level == 3) {
				//·£´ı¼ıÀÚ 1~20»çÀÌ·Î Á¤´ä ³ª¿À°Ô ¼³Á¤
				c_answer = rand() % 20 + 1;
				//¸ÂÃß¸é ÁÙ Á¡¼ö
				score = 100;
			}
			// level 2 = ³­ÀÌµµ Áß`
			else if (level == 2) {
				//·£´ı¼ıÀÚ 1~10»çÀÌ·Î Á¤´ä ³ª¿À°Ô ¼³Á¤
				c_answer = rand() % 10 + 1;
				score = 50;
			}
			//level 1 = ³­ÀÌµµ ÇÏ (levelÀÌ 2,3ÀÌ ¾Æ´Ï´Ï ³ª¸ÓÁö 1)
			else {
				//·£´ı¼ıÀÚ 1~5»çÀÌ·Î Á¤´ä ³ª¿À°Ô ¼³Á¤
				c_answer = rand() % 5 + 1;
				score = 25;
			}

			//<<<<<·£´ı¼ıÀÚ(Á¤´ä c_answer) ¸ÂÃß±â °ÔÀÓ ½ÃÀÛ>>>>>>
			//3¹øÂ°±îÁö ½ÃµµÇÒ ¼ö ÀÖ°Ô ÇÏ¸ç, ½Ãµµ¿¡ ½ÇÆĞÇÒ¶§¸¶´Ù º¸»óÁ¡¼ö ±ğ¾Æ¼­ ÁÖ±â
			for (int i = 0; i < score / 10; i++) {
				//i < score / 10;  <=ÀÌ ºÎºĞ ÀÌÇØ ¾ÈµÊ!!!!!!!!!!!!!!!

				//½ÃµµÇÒ¶§¸¶´Ù ¸î¹øÂ° ½ÃµµÀÎÁö ¾Ë·ÁÁÖ¸ç ÀÔ·ÂÇÏ°Ô ÇÏ±â
				printf("%d¹øÂ° ½Ãµµ Á¤´ä ÀÔ·Â >>>>> ", i + 1);

				//À¯Àú°¡ ¼ıÀÚ ÀÔ·Â
				scanf("%d", &choice);

				//u_score º¯¼ö ¼±¾ğ&»ç¿ë <- ½ÃµµÇÒ¶§¸¶´Ù »ı±â´Â µæÁ¡
				int u_score = score - (i * 10);//½ÇÆĞ½Ã

				//¸Â­ŸÀ» ¶§, ¸îÁ¡ Ãß°¡µÈ°ÇÁö ¾Ë·ÁÁÖ±â & ÃÑÁ¡¼ö¿¡ µæÁ¡ ³Ö¾îÁÖ±â
				if (c_answer == choice) {
					printf("Á¤´ä!, %dÁ¡ÀÌ Ãß°¡µË´Ï´Ù!\n", u_score);
					totalScore += u_score;
					break;
				}
				//Æ²·ÈÀ» ¶§, scroe/10¹ø±îÁö ³¡³µÀ» ¶§, Á¤´ä ¾Ë·ÁÁÖ±â
				printf("%d¹øÂ° ½Ãµµ ¶¯!\n", i + 1);
				if ((i + 1) == (score / 10)) {
					printf("Á¤´äÀº %d¿´½À´Ï´Ù.\n", c_answer);
				}
			}
		} // 2¹ø °ÔÀÓÇÏ±â ´İ´Â Áß°ıÈ£



		//[3.³» Á¡¼ö º¸±â] ¼±ÅÃÇßÀ» ¶§
		else if (choice == 3) {
			printf("Á¡¼ö ÃÑÇÕ : %d\n", totalScore);
		}
		else {
			printf("´Ù½Ã ÀÔ·ÂÇÏ¼¼¿ä!\n");
			//<===choice°¡ 4,1,2,3 ¾Æ´Ñ°ÍÀ» ³ÖÀ»¶§ ³ª¿À´Â ¹®±¸! ´Ù½Ã °í¸£¶ó°í...
		}
	} // Å« while¹® ´İ´Â Áß°ıÈ£ = while¹® ¾ÈÀÇ ½ÇÇà¹®À» ¸¸Á·ÇÏÁö ¾ÊÀ» ¶§ ³ª¿Â´Ù.=> choice=4

	//[4.Á¾·áÇÏ±â]·Î "4¹ø ´­·¯¼­ Á¾·á"¹®±¸ ¶ß°Ô ÇÑ µÚ, È®½ÇÇÏ°Ô Á¾·áÇÔÀ» ¾Ë¸®±â À§ÇØ "°ÔÀÓ Á¤»ó Á¾·á"¹®±¸ ÇÑ¹ø ´õ ¶ç¿ò.
	printf("\n°ÔÀÓ Á¤»ó Á¾·á\n");

	return 0;
}